Repository: GLeyte/Playing-with-Fractals
Catalog: Fractal/Localizable.xcstrings
Source language: en
Languages: pt_br

# butao1
source: Explore more
pt_br: Explorar mais

# butao2
source: Let's find out how it works
pt_br: Vamos descobrir como funcionam

# butao3
source: Let's create our own fractal
pt_br: Vamos criar o nosso próprio fractal

# parameter1
source: Number of iterations:
pt_br: Número de iterações:

# parameter2
source: Branch reduction:
pt_br: Redução dos galhos:

# parameter3
source: Branch's angle:
pt_br: Ângulo dos galhos:

# tela1
source: Fractals can be found in lots of things in nature, like snowflakes, trees and even lightning bolt moves.
pt_br: Fractais podem ser encontrados em muitas coisas na natureza, como flocos de neve, árvores e até movimentos de raios.

# tela2
source: Fractal is a shape that repeats itself repeatedly creating geometric patterns with all kind of shapes, like the tree above and the snowflake before.
pt_br: Fractal é uma forma que se repete repetidamente, criando padrões geométricos com todo o tipo de formas, como a árvore acima e o floco de neve antes.

# tela3
source: This fractal is a part of the Koch snowflake. As you can see, there is a rule that the fractal follows. These rules are like a recipe to create an image that appears to be made of smaller copies of itself. In this case, every line must turn into one line, an upper triangle and another line.
pt_br: Este fractal é uma parte do floco de neve de Koch. Como pode-se ver, há uma regra que o fractal segue. Estas regras são como uma receita para criar uma imagem que parece ser feita de cópias mais pequenas de si mesma. Neste caso, cada linha deve transformar-se em uma linha, um triângulo superior e outra linha.

# title1
source: Playing with Fractals
pt_br: Brincando com Fractais

# title2
source: But what are Fractals?
pt_br: Mas o que são Fractais?

# title3
source: How Fractals work?
pt_br: Como funcionam os Fractais?

# title4
source: Select your Fractal
pt_br: Escolha o seu Fractal
